Documents/_НачислениеФондов2016.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>_НачислениеФондов2016</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГодПроекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяБазыНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБазаРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/БюджетПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетПоМесяцам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Comment>Факт облагается РКО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПланаБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСуммыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СтруктураСметыПоГодам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СтруктураСметыПоГодам</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтруктураСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураСметы</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипСуммыБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипСуммыБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПервичныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/_НачислениеФондов2016/Forms/ФормаДокумента/Ext/Form/Module.bsl
// статья начисления не итоговая
// статья базы может быть итоговой
&НаСервере
Процедура НачислитьНаСервере()
	
	Док = РеквизитФормыВЗначение("Объект");
	Док.Начисление.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БюджетПоМесяцамОбороты.ЗадачаПроекта,
		|	БюджетПоМесяцамОбороты.СтатьяСметы,
		|	СУММА(БюджетПоМесяцамОбороты.СуммаОборот) КАК Сумма,
		|	БюджетПоМесяцамОбороты.ЗадачаПроекта.Владелец.Код КАК ЗадачаПроектаВладелецКод
		|ИЗ
		|	РегистрНакопления.БюджетПоМесяцам.Обороты КАК БюджетПоМесяцамОбороты
		|ГДЕ
		|	БюджетПоМесяцамОбороты.ТипСуммы = &ТипСуммыПлан
		|	И БюджетПоМесяцамОбороты.Месяц = &Месяц
		|	И БюджетПоМесяцамОбороты.СтатьяСметы В(&СтатьиСметы)
		|	И БюджетПоМесяцамОбороты.ЗадачаПроекта.Подразделение = &Подразделение
		|	И БюджетПоМесяцамОбороты.ЗадачаПроекта.Владелец.ГодПроекта = &ГодПроекта
		|
		|СГРУППИРОВАТЬ ПО
		|	БюджетПоМесяцамОбороты.СтатьяСметы,
		|	БюджетПоМесяцамОбороты.ЗадачаПроекта
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачаПроектаВладелецКод";
		
		
	Запрос.УстановитьПараметр("ГодПроекта", 	Объект.ГодПроекта);
	Запрос.УстановитьПараметр("Месяц", 			НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("Подразделение", 	Объект.Подразделение );
	// статьи, входящие в расчет итоговой
	СтатьиСметы = СтатьиВходящиеВИтоговую( Объект.СтатьяБазыНачисления, СтруктураСметы); 		
	Запрос.УстановитьПараметр("СтатьиСметы", 	СтатьиСметы);
	// 2017 02 17
	//Запрос.УстановитьПараметр("ТипСуммыПлан", 	Перечисления.ТипСуммыБюджета.План);
	Запрос.УстановитьПараметр("ТипСуммыПлан", 	Перечисления.ТипСуммыБюджета.Факт);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	тзЗадачи = РезультатЗапроса.Скопировать();
	тзЗадачи.Свернуть("ЗадачаПроекта");
	Для Каждого СтрЗП ИЗ тзЗадачи Цикл
		ЗадачаПроекта = СтрЗП.ЗадачаПроекта;
		// может быть фонд ДП или КМ, поэтому не понятно
		//Если ФондДП(ЗадачаПроекта) = 0 Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Отбор = Новый Структура("ЗадачаПроекта", ЗадачаПроекта );
		тзПоЗадаче 				= РезультатЗапроса.Скопировать( Отбор );
		СтрДок 					= Док.Начисление.Добавить();
		СтрДок.ЗадачаПроекта 	= ЗадачаПроекта;
		
		СтрокаФормулы 	= РазвернутьФормулуРасчета( Объект.СтатьяБазыНачисления, СтруктураСметы, тзПоЗадаче );
		СуммаБаза		= Вычислить( СтрокаФормулы );
		
		
		СтрДок.СуммаБазаРаспределения 	= СуммаБаза;
		СтрДок.СуммаНачислено			= Окр(СтрДок.СуммаБазаРаспределения * Док.ПроцентНачисления/100, 2);
	КонецЦикла;
		
	ЗначениеВРеквизитФормы( Док, "Объект");
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СуммаПоНеИтоговойСтатье( СтатьяСметы,  тзПоЗадаче )
	СтрСумма = тзПоЗадаче.Найти( СтатьяСметы, "СтатьяСметы" );
	Если СтрСумма = Неопределено Тогда
		Возврат "0";
	КонецЕсли;
	Возврат Формат( СтрСумма.Сумма,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0") ;
КонецФункции


&НаСервереБезКонтекста
Функция РазвернутьФормулуРасчета( СтатьяСметы, СтруктураСметы, тзПоЗадаче )
	// строка таблицы значений
	СтрокаСтруктуры = ПолучитьСтрокуСтруктуры( СтатьяСметы, СтруктураСметы );
	// не должно такого быть, заглушка
	Если СтрокаСтруктуры = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	ФормулаРасчета = СокрЛП( СтрокаСтруктуры.ФормулаРасчета);
	
	Если НЕ СтрокаСтруктуры.Итоговая Тогда
		Возврат СуммаПоНеИтоговойСтатье( СтрокаСтруктуры.Статья,  тзПоЗадаче )
	КонецЕсли;
	
	мСтрок = СтрРазделить( СтрокаСтруктуры.ФормулаРасчета, "+-/");
	
	// имя предопределенного статьи 
	Для Каждого Эл ИЗ мСтрок Цикл
		СтатьяЭл = Справочники.СтатьиСметы[СокрЛП(Эл)];
		СтрокаСтруктуры = ПолучитьСтрокуСтруктуры( СтатьяЭл, СтруктураСметы );
		Если СтрокаСтруктуры.Итоговая Тогда
			// меняем имя на формулу
			РазвернутаяФормула 	= РазвернутьФормулуРасчета( СтрокаСтруктуры.Статья, СтруктураСметы, тзПоЗадаче );
			ФормулаРасчета		= СтрЗаменить( ФормулаРасчета, Эл, "(" + РазвернутаяФормула + ")");
		Иначе
			// заменяем на значение
			ФормулаРасчета		= СтрЗаменить( ФормулаРасчета, Эл, СуммаПоНеИтоговойСтатье( СтрокаСтруктуры.Статья,  тзПоЗадаче ));
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ФормулаРасчета;
КонецФункции


// формируем развернутую формулу для итоговой статьи структуры расчета
// заменяем
//&НаСервереБезКонтекста
//Функция РасчетИтоговойСуммы( СтатьяСметы,  тзПоЗадаче, СтруктураСметы )
//	ИтоговаяСумма = 0;
//	
//	СтрокаСтруктуры = ПолучитьСтрокуСтруктуры( СтатьяСметы, СтруктураСметы );
//	// не должно такого быть, заглушка
//	Если СтрокаСтруктуры = Неопределено Тогда
//		Возврат ИтоговаяСумма;
//	КонецЕсли;
//	
//	// если строка не итоговая, то возвращаем ее сумму
//	Если НЕ СтрокаСтруктуры.Итоговая Тогда
//		Возврат СуммаПоНеИтоговойСтатье( СтрокаСтруктуры.Статья,  тзПоЗадаче );
//	КонецЕсли;
//	
//	// Если строка итоговая
//	мСтрок = СтрРазделить( СтрокаСтруктуры.ФормулаРасчета, "+-/");
//	// имя предопределенного статьи 
//	Для Каждого Эл ИЗ мСтрок Цикл
//		СтатьяЭл = Справочники.СтатьиСметы[СокрЛП(Эл)];
//		СтрокаСтруктуры = ПолучитьСтрокуСтруктуры( СтатьяЭл, СтруктураСметы );
//		Если СтрокаСтруктуры.Итоговая Тогда
//			ИтоговаяСумма = ИтоговаяСумма + РасчетИтоговойСуммы( СтрокаСтруктуры.Статья,  тзПоЗадаче, СтруктураСметы )
//		Иначе
//			ИтоговаяСумма = ИтоговаяСумма + СуммаПоНеИтоговойСтатье( СтрокаСтруктуры.Статья,  тзПоЗадаче );
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат ИтоговаяСумма;
//	
//КонецФункции




&НаКлиенте
Процедура Начислить(Команда)
	НачислитьНаСервере();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура УстановитьСтруктуруСметыПоГодуПроекта()
	МенЗап = РегистрыСведений.СтруктураСметыПоГодам.ПолучитьПоследнее( НачалоГода(Дата( Объект.ГодПроекта, 1, 1)));
	СтруктураСметы = МенЗап.СтруктураСметы;
	//
	УстановитьСписокВыбораСтатей();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МассивСтатейДляВыбора( СтруктураСметы,  Итоговые = Ложь, НеИтоговые = Ложь )
	мСтатей = Новый Массив;
	Для Каждого Стр ИЗ СтруктураСметы.Структура Цикл
		Если Итоговые И Стр.Итоговая Тогда
			мСтатей.Добавить( Стр.Статья );
		КонецЕсли;
		Если НеИтоговые И НЕ Стр.Итоговая Тогда
			мСтатей.Добавить( Стр.Статья );
		КонецЕсли;
	КонецЦикла;
	Возврат мСтатей;
			
КонецФункции

&НаСервере
Процедура УстановитьСписокВыбораСтатей()
	// все
	мСтатьи = МассивСтатейДляВыбора( СтруктураСметы,  Истина, Истина );
	Элементы.СтатьяБазыНачисления.СписокВыбора.ЗагрузитьЗначения( мСтатьи );
	// только не групповые
	мСтатьи = МассивСтатейДляВыбора( СтруктураСметы,  Ложь, Истина );
	Элементы.СтатьяНачисления.СписокВыбора.ЗагрузитьЗначения( мСтатьи );
	
КонецПроцедуры

// заполняем список выбора статей по году 
&НаКлиенте
Процедура ГодПроектаПриИзменении(Элемент)
	УстановитьСтруктуруСметыПоГодуПроекта();
	//УстановитьСписокВыбораСтатей();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьСтруктуруСметыПоГодуПроекта();
	//УстановитьСписокВыбораСтатей();
КонецПроцедуры

// создаем массив статей, входящих в итоговую статью
// и формулу расчета
&НаКлиенте
Процедура СтатьяБазыНачисленияПриИзменении(Элемент)
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСтрокуСтруктуры( Статья, СтруктураСметы )
	Отбор = Новый Структура("Статья", Статья );
	СтрСС 	= СтруктураСметы.Структура.НайтиСтроки( Отбор );
	
	Если СтрСс.Количество() = 0 Тогда Возврат Неопределено; КонецЕсли;
	Возврат СтрСс[0];
	
КонецФункции

&НаСервереБезКонтекста
Функция СтатьиВходящиеВИтоговую( СтатьяСметы, СтруктураСметы )
	мСтатей = Новый Массив;
	СтрокаСтруктуры = ПолучитьСтрокуСтруктуры( СтатьяСметы, СтруктураСметы );
	// не должно такого быть, заглушка
	Если СтрокаСтруктуры = Неопределено Тогда
		Возврат мСтатей;
	КонецЕсли;
	
	Если НЕ СтрокаСтруктуры.Итоговая Тогда
		мСтатей.Добавить( СтатьяСметы );
		Возврат мСтатей;
	КонецЕсли;
	
	// пока кроме рентабельности
	мСтрок = СтрРазделить( СтрокаСтруктуры.ФормулаРасчета, "+-/");
	// имя предопределенного статьи 
	Для Каждого Эл ИЗ мСтрок Цикл
		СтатьяЭл = Справочники.СтатьиСметы[СокрЛП(Эл)];
		СтрокаСтруктуры = ПолучитьСтрокуСтруктуры( СтатьяЭл, СтруктураСметы );
		Если СтрокаСтруктуры.Итоговая Тогда
			мСЭл = СтатьиВходящиеВИтоговую( СтрокаСтруктуры.Статья, СтруктураСметы );
			Для Каждого ЭлЭл ИЗ мСЭл Цикл
				мСтатей.Добавить( ЭлЭл );
			КонецЦикла;
		Иначе
			мСтатей.Добавить( СтрокаСтруктуры.Статья );
		КонецЕсли;
	КонецЦикла;
	
	Возврат мСтатей;
КонецФункции

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	Объект.ПериодРегистрации = НачалоМесяца( Объект.ПериодРегистрации );
КонецПроцедуры
